#include "all.h"

//========================================================================
// 描述: 单片机端口初始化
// 说明：STC15W4K32S4系列单片机，在上电后与PWM相关的IO为高阻状态，需手动设置为普通双向IO
// PWM相关IO为 : P0.6/P0.7/P1.6/P1.7/P2.1/P2.2
//               P2.3/P2.7/P3.7/P4.2/P4.4/P4.5						 
//========================================================================
/*========================================================================
≥40Pin整机不要超过120mA,20Pin~32Pin整机不要超过90mA
PXM1	PXM0		I/O模式
	0			0			准双向I/O口：弱上拉,灌电流20mA,拉电流270uA~150uA
	0			1			推挽输出：强上拉输出,可达20mA,要加限流电阻
	1			0			高阻态：
	1			1			开漏输出：内部上拉电阻断开.需外加上拉电阻才可读取/输出高低电平状态.
例如:MOV P0M1,#10100000B
		 MOV P0M0,#11000000B
P0.7开漏输出(1 1),P0.6推挽输出(0 1),P0.5高阻态(1 0),其余皆为准双向口/弱上拉
========================================================================*/
void driGpioInit(void)
{
	P0M0=0x20;//W25Q16 CS
	P0M1=0x20;//P0.5开漏输出
	
	P1M0=0x3C;//SPI相关
	P1M1=0x3C;//P1.5,P1.4,P1.3,P1.2开漏输出
	
	P2M0=0x00;//其余全部设置为准双向口/弱上拉
	P2M1=0x00;
	P3M0=0x00;
	P3M1=0x00;
	P4M0=0x00;
	P4M1=0x00;
	P5M0=0x00;
	P5M1=0x00;	
}